"appName" = "Inlaider (fi)";


"popup.command.placeholder.typeACommand" = "Kirjoita komento...";
"popup.command.placeholder.typeACommandOrEnterQuit" = "Kirjoita komento tai paina Enter sulkeaksesi...";
"popup.command.placeholder.typeACommandOrEnterPaste" = "Kirjoita komento tai paina Enter liittääksesi tuloksen";
"popup.navigation.focusCanvas.label" = "⌘ ⬆️ — siirtyy editoriin";
"popup.navigation.focusCommandline.label" = "⌘ ⬇️ — siirtyy komentoriville";
"popup.shortcut.clearCanvas" = "⌘⌫ tyhjentää editorin";
"popup.shortcut.copyCanvas" = "⌘C kopioi editorin sisällön";
"popup.shortcut.copyCanvasOrEnterCopy" = "⌘C tai Enter kopioi editorin sisällön";
"popup.shortcut.enterPaste" = "Enter liittää";
"popup.shortcut.esc" = "Esc sulkee";

"show" = "Näytä";
"about" = "Tietoa ohjelmasta";
"quit" = "Lopeta";
"close" = "Sulje";
"cancel" = "Peruuta";
"save" = "Tallenna";
"ok" = "OK";
"settings" = "Asetukset";
"copied" = "Kopioitu";

"settings.section.general.title" = "Yleiset";
"settings.accessibility.title" = "Käyttöoikeudet";
"settings.accessibility.description" = "Tämä käyttöoikeus on tarpeen, jotta valittu teksti voidaan lukea automaattisesti ja käsitelty tulos voidaan liittää takaisin alkuperäiseen tekstikenttään.\nIlman käyttöoikeutta sovellus käyttää leikepöytää tietojen siirtämiseen.";
"settings.inlaiderShortcut.label" = "Pikanäppäin Inlaiderille";
"settings.LaunchAtLogin.label" = "Käynnistä kirjautuessa";

"settings.section.ownAPIKeys.title" = "Omat API-avaimet";
"provider.apiKey.title" = "API-avain";
"provider.apiKey.placeholder" = "Syötä API-avain tähän";
"provider.models.title" = "Mallit";
"provider.models.new.placeholder" = "Lisää mallin nimi";

"settings.section.customPrompts.title" = "Mukautetut kehotteet";
"prompts.general.title" = "Yleinen kehotus";
"prompts.replacements.title" = "Kehotteiden korvaukset";
"prompts.replacements.replaceWhat.label" = "Korvaa";
"prompts.replacements.model.label" = "Malli";
"prompts.replacements.replaceWith.label" = "Korvaa kehotteella";
"prompts.replacements.error.exists.message" = "Kehotteen korvaus '%@' on jo olemassa.";

"about.ThirdPartyLicenses" = "Kolmannen osapuolen lisenssit";
"about.VisitOnGithub" = "Katso GitHubissa";
"about.version" = "Versio %@";

"error.title" = "Virhe";